//1. 컴퓨터가 1과 10사이의 임의의 정수를 정하면 사용자가 알아맞추는 자바스크립트 게임을 작성하세요.
let random = Math.ceil(Math.random() * 10);
let user = prompt("알아맞춰보세요!");
if (random == user) {
    document.write("정답입니다!");
}
else {
    document.write("땡~~!");
}

//2. 내용 1과 2를 입력 받는 input 을 만든 후 1과 2에 입력 받은 숫자의 
//   곱셈버튼 나눗셈버튼을 만들어 결과를 출력하는 프로그램을 작성하시오.

 

//3. 웹사이트의 url을 팝업으로 출력시키시오.

 

//4. 파일이름과 확장자를 가져오는 스크립트를 작성하시오.

 

//5. 임의의 숫자와 13 사이의 차를 구하는 스크립트를 작성하시오. 단 숫자가 13보다 넓으면 절대 차이의 두 배를 반환 합니다.

 

//6. 주어진 두 정수의 합을 계산하는 스크립트를 작성하시오. 단, 두 값이 동일하면 그 합을 세 배로 반환합니다.

 

//7. 지정된 숫자와 19사이의 절대 차를 계산 하는 스크립트를 작성하시오. 단 지정된 숫자가 19보다 큰 경우 절대 차의 3배를 반환합니다.

 

//8. 주어진 두 개의 수자 중 하나가 50이거나 그 합이 50이면 true를 반환하는 스크립트를 작성하시오.

 

//9. 임의의 두 개의 정수가 하나는 양수 하나는 음수이면 true 를 반환하는 스크립트를 작성하시오.

 

//10. 임의의 문자열 앞에 Py를 추가하여 문자열을 생성하는 스크립트를 작성하시오. 단, 임의의 문자열이 Py로 시작하면 원래 문자열을 그대로 반환합니다.

 
